Oct-20-backup-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-19 Thu 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab 5 Notes</title>
<meta name="author" content="Tianyu Chen" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Lab 5 Notes</h1>
<p>
<a href="https://iudatastructurescourse.github.io/course-web-page-fall-2023/">🔙HOME</a>
</p>

<div id="outline-container-orgf181c25" class="outline-2">
<h2 id="orgf181c25">Binomial Heaps</h2>
<div class="outline-text-2" id="text-orgf181c25">
<p>
Please review <a href="https://iudatastructurescourse.github.io/course-web-page-fall-2023/lectures/Oct-16.html">Monday's lecture notes</a> before you start.
<b>Also, directly copying code from textbook Section 6.8 does not work!</b>
</p>
</div>

<div id="outline-container-org856e7a2" class="outline-3">
<h3 id="org856e7a2">The <code>BinomialHeap</code> class:</h3>
<div class="outline-text-3" id="text-org856e7a2">
<ul class="org-ul">
<li>corresponds to a tree</li>
<li>each node has a <code>PList</code> of children, sorted in descending heights</li>
<li><code>link()</code> connects two \(B_k\) and get one \(B_{k+1}\):
<ul class="org-ul">
<li>keys of the root nodes are compared by <code>lessEq.test()</code></li>
<li>used in <code>insert()</code> and (the binary long addition version of) <code>merge()</code></li>
</ul></li>
<li><code>isHeap()</code> decides if the tree satisfies the (max) heap property</li>
</ul>
</div>
</div>

<div id="outline-container-org4ce1c49" class="outline-3">
<h3 id="org4ce1c49">The <code>BinomialQueue</code> class:</h3>
<div class="outline-text-3" id="text-org4ce1c49">
<ul class="org-ul">
<li>corresponds to a forest</li>
<li>trees sorted in ascending heights</li>
<li><code>isHeap()</code>: if each tree satisfies the heap property, then the entire
forest is a heap</li>
<li><code>insert()</code>:
<ul class="org-ul">
<li>if the height of the tree is less than that of the first tree in
the forest, cons the tree to the front and we're done</li>
<li>otherwise, find tree whose height is equal to the tree to insert,
link those two trees and recursively insert result into the rest of
the forest</li>
</ul></li>
<li><code>merge()</code>, two ways, both acceptable for this lab:
<ul class="org-ul">
<li>the slow \(O(log^2(n))\) way: insert trees in one forest one by one
into the other</li>
<li>the appropriate \(O(log(n))\) way: analogous to long addition of binary numbers
<ul class="org-ul">
<li>has proper time complexity, but is a little tricky to implement</li>
<li>[example] (adapted from textbook Fig. 6.36 - 6.38)</li>
</ul></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-text">  B0            B1          B2

                18           65
                 |           | \
                16          24  21
                             |
                            12

  13            26            65
                 |            | \
                14           24  51
                              |
                             23
------------------------------------------------------- merge
                      ??
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-10-20 Fri 00:00</p>
<p class="author">Author: Tianyu Chen</p>
<p class="date">Created: 2023-10-19 Thu 16:58</p>
</div>
</body>
</html>